#include "gpio_init.h"
#include "freertos.h"
#include "task.h"

#include "Sys/sys_task.h"
#include "timer_task.h"
#include "Print/print_task.h"

/***********************************************************************************************************************
-----函数功能    IO口初始化
-----说明(备注)  none
-----传入参数    none
-----输出参数    none
-----返回值      none
************************************************************************************************************************/ 
void vGPIO_Init(void)
{
    /* 12V电源使能 PC2，默认低电平（关闭） */
    rcu_periph_clock_enable(gpio12V_EN_RCU);
    gpio_init(gpio12V_EN_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_2MHZ, gpio12V_EN_PIN);
    gpio12V_OFF();

}




/***********************************************************************************************************************
-----函数功能    21V电源开关
-----说明(备注)  none
-----传入参数    none
-----输出参数    none
-----返回值      true:操作成功    false:操作失败
************************************************************************************************************************/ 
//bool vGPIO_V21PowerSwitch(bool en)
//{
//	if(en == true)
//	{
//		gpioVCC21_EN_ON();
//		return  true;
//	}
//	else 
//	{
//		gpioVCC21_EN_OFF();
//		return  false;
//	}
//}

/***********************************************************************************************************************
-----函数功能    12V总线电源开关
-----说明(备注)  none
-----传入参数    en: true=开  false=关
-----输出参数    none
-----返回值      none
************************************************************************************************************************/ 
void vGPIO_12VPowerSwitch(bool en)
{
    if(en == true)
        gpio12V_ON();
    else
        gpio12V_OFF();
}



#if(boardLOW_POWER)
/***********************************************************************************************************************
-----函数功能    IO口进入低功耗
-----说明(备注)  none
-----传入参数    none
-----输出参数    none
-----返回值      none
************************************************************************************************************************/ 
void vGPIO_EnterLowPower(void)
{
    gpio_init(gpio12V_EN_PORT, GPIO_MODE_AIN, GPIO_OSPEED_2MHZ, gpio12V_EN_PIN);
}


/***********************************************************************************************************************
-----函数功能    IO口退出低功耗
-----说明(备注)  none
-----传入参数    none
-----输出参数    none
-----返回值      none
************************************************************************************************************************/ 
void vGPIO_ExitLowPower(void)
{
    vGPIO_Init();
}
#endif
